/**
 * +----------------------------------------------------------------------
 * | 「e家宜业」
 * +----------------------------------------------------------------------
 * | Copyright (c) 2020-2024  All rights reserved.
 * +----------------------------------------------------------------------
 * | Licensed 未经授权禁止移除「e家宜业」和「卓佤科技」相关版权
 * +----------------------------------------------------------------------
 * | Author: 
 * +----------------------------------------------------------------------
 */

export default {
    userInfo: state => state.userInfo,
    postInfo: state => state.postInfo,
    waterMark: state => state.waterMark,
    unreadNotices: state => state.unreadNotices
};
