/**
 * +----------------------------------------------------------------------
 * | 「e家宜业」
 * +----------------------------------------------------------------------
 * | Copyright (c) 2020-2024  All rights reserved.
 * +----------------------------------------------------------------------
 * | Licensed 未经授权禁止移除「e家宜业」和「卓佤科技」相关版权
 * +----------------------------------------------------------------------
 * | Author: 
 * +----------------------------------------------------------------------
 */

import { CwComponent } from '../common/component';
import * as config from '../../config';

CwComponent({
    data: {
        version: config.VERSION
    },
    props: {
        fixed: Number,
        dark: Boolean,
        inTabPage: Boolean
    }
});
